# ==============================
# ДОДАТКОВІ ОБЧИСЛЕННЯ
# ==============================

print("=" * 30)  # Рамка
print("ДОДАТКОВІ ОБЧИСЛЕННЯ")  # Заголовок
print("=" * 30)

# Корені
print("√144 =", 144 ** 0.5)                 # Квадратний корінь числа 144
print("∛27 =", 27 ** (1/3))                 # Кубічний корінь числа 27

# Діагональ прямокутника
width = 12                                                       # Задаємо ширину прямокутника
height = 5                                                       # Задаємо висоту прямокутника
print("Діагональ =", (width**2 + height**2) ** 0.5)              # Формула Піфагора для знаходження діагоналі         

# Калькулятор знижок
print("=" * 30)  # Рамка
print("КАЛЬКУЛЯТОР ЗНИЖОК")  # Заголовок
print("=" * 30)

total = 100 + 200 + 300                                         # Обчислюємо загальну суму трьох товарів
print("Загальна сума:", total)                                  # Виводимо загальну суму
print("До сплати (зі знижкою 25%):", total * 0.75)              # Обчислюємо та виводимо суму зі знижкою 25%

print("=" * 30)  # Рамка