f1 = int(input("Введіть перше число: "))
f2 = int(input("Введіть друге число: "))
f3 = input("Введіть операцію (+, -, *, /, //, **): ")

if f3 == "+":                # додавання
    result = f1 + f2 
elif f3 == "-":              # віднімання
    result = f1 - f2
elif f3 == "*":              # множення
    result = f1 * f2
elif f3 == "/":              # ділення
    result = f1 / f2 
elif f3 == "//":             # цілочисельне ділення
    result = f1 // f2
elif f3 == "**":             # піднесення до степеня
    result = f1 ** f2
else:                      # якщо введена невідома операція
    result = "Невідома операція"

print("Результат:", result)           # показуємо результат