f1 = int(input("Введіть певну оцінку: "))

if f1 >= 90:               # якщо оцінка 90 або більше
    print("Відмінно")      # виводимо "Відмінно"

elif f1 >= 80:             # інакше, якщо оцінка від 80 до 89
    print("Чудово")        # виводимо "Чудово"

elif f1 >= 50:             # інакше, якщо оцінка від 50 до 79
    print("Середньо")      # виводимо "Середньо"

elif f1 >= 25:             # інакше, якщо оцінка від 25 до 49
    print("Дуже погано")        # виводимо "Дуже погано"

else:                               # якщо менше ніж 25
    print("Оцінка незадовільна")    # повідомляємо, що оцінка незадовільна