# ==============================
# КОНВЕРТЕР ТЕМПЕРАТУРИ
# ==============================

c = 25                          # Задаємо температуру в градусах Цельсія
f = c * 9/5 + 32                # Формула переведення з Цельсія у Фаренгейти
 
print("=" * 30)  # Рамка
print("КОНВЕРТЕР ТЕМПЕРАТУРИ")  # Заголовок
print("=" * 30)

print(c, "°C =", f, "°F")                           # Вивід переведення з °C у °F
print(f, "°F =", (f - 32) * 5/9, "°C")              # Формула переведення з Фаренгейтів назад у Цельсії

print("=" * 30)